{"id":31243,"date":"2020-06-09T09:01:52","date_gmt":"2020-06-09T09:01:52","guid":{"rendered":"http:\/\/sharifrealty.com\/?p=44"},"modified":"2020-06-09T09:01:52","modified_gmt":"2020-06-09T09:01:52","slug":"existing-home-sales-slid-5-4-in-june","status":"publish","type":"post","link":"https:\/\/sharifrealty.com\/existing-home-sales-slid-5-4-in-june\/","title":{"rendered":"Existing-Home Sales Slid 5.4% in June"},"content":{"rendered":"<p>[vc_row][vc_column][vc_column_text]<\/p>\n<p><strong>Key Highlights<\/strong><\/p>\n<ul>\n<li>Existing-home sales declined for the fifth straight month to a seasonally adjusted annual rate of 5.12 million. Sales were down 5.4% from May and 14.2% from one year ago.<\/li>\n<li>The median existing-home sales price climbed 13.4% from one year ago to $416,000, a new record high.<\/li>\n<li>The inventory of unsold existing homes rose to 1.26 million by the end of June, or the equivalent of 3.0 months at the current monthly sales pace.<\/li>\n<\/ul>\n<p>WASHINGTON (July 20, 2022) – Existing-home sales dropped for the fifth straight month in June, according to the National Association of REALTORS®. Three out of four major U.S. regions experienced month-over-month sales declines and one region held steady. Year-over-year sales sank in all four regions.<\/p>\n<p>Total existing-home sales,<sup>1<\/sup> <a href=\"https:\/\/www.nar.realtor\/research-and-statistics\/housing-statistics\/existing-home-sales\">https:\/\/www.nar.realtor\/existing-home-sales<\/a>, completed transactions that include single-family homes, townhomes, condominiums and co-ops, dipped 5.4% from May to a seasonally adjusted annual rate of 5.12 million in June. Year-over-year, sales fell 14.2% (5.97 million in June 2021).<\/p>\n<p>&#8220;Falling housing affordability continues to take a toll on potential home buyers,&#8221; said NAR Chief Economist Lawrence Yun. &#8220;Both mortgage rates and home prices have risen too sharply in a short span of time.&#8221;<\/p>\n<p>Total housing inventory<sup>2<\/sup> registered at the end of June was 1,260,000 units, an increase of 9.6% from May and a 2.4% rise from the previous year (1.23 million). Unsold inventory sits at a 3.0-month supply at the current sales pace, up from 2.6 months in May and 2.5 months in June 2021.<\/p>\n<p>The median existing-home price<sup>3<\/sup> for all housing types in June was $416,000, up 13.4% from June 2021 ($366,900), as prices increased in all regions. This marks 124 consecutive months of year-over-year increases, the longest-running streak on record.<\/p>\n<p>Properties typically remained on the market for 14 days in June, down from 16 days in May and 17 days in June 2021. The 14 days on market are the fewest since NAR began tracking it in May 2011. Eighty-eight percent of homes sold in June 2022 were on the market for less than a month.<\/p>\n<p>&#8220;Finally, there are more homes on the market,&#8221; Yun added. &#8220;Interestingly though, the record-low pace of days on market implies a fuzzier picture on home prices. Homes priced right are selling very quickly, but homes priced too high are deterring prospective buyers.&#8221;<\/p>\n<p>First-time buyers were responsible for 30% of sales in June, up from 27% in May and down from 31% in June 2021. NAR&#8217;s 2021 Profile of Home Buyers and Sellers – <a href=\"https:\/\/www.nar.realtor\/newsroom\/home-buyers-motivated-by-desire-to-be-closer-to-family-and-friends-sellers-collected-full-asking-price\">released in late 2021<\/a><sup>4<\/sup> – reported that the annual share of first-time buyers was 34%.<\/p>\n<p>All-cash sales accounted for 25% of transactions in June, the same share as in May and up from 23% in June 2021.<\/p>\n<p>Individual investors or second-home buyers, who make up many cash sales, purchased 16% of homes in June, unchanged from May and a slight increase from 14% in June 2021.<\/p>\n<p>Distressed sales<sup>5<\/sup> – foreclosures and short sales – represented less than 1% of sales in June, essentially unchanged from May 2022 and June 2021.<\/p>\n<p>According to Freddie Mac, the <a href=\"https:\/\/www.freddiemac.com\/pmms\/pmms30\">average commitment rate(link is external)<\/a> for a 30-year, conventional, fixed-rate mortgage was 5.52% in June, up from 5.23% in May. The average commitment rate across all of 2021 was 2.96%.<\/p>\n<p>&#8220;If consumer price inflation continues to rise, then mortgage rates will move higher,&#8221; Yun said. &#8220;Rates will stabilize only when signs of peak inflation appear. If inflation is contained, then mortgage rates may even decline somewhat.&#8221;<\/p>\n<p><a href=\"https:\/\/www.realtor.com\/research\/may-2022-data\/\">Realtor.com®&#8217;s Market Trends Report(link is external)<\/a> in June shows that the largest year-over-year median list price growth occurred in Miami (+40.1%), Orlando (+30.6%) and Nashville (+30.6%). Austin reported the highest increase in the share of homes that had their prices reduced compared to last year (+24.7 percentage points), followed by Phoenix (+22.2 percentage points) and Las Vegas (+20.1 percentage points).<\/p>\n<p><strong>Single-family and Condo\/Co-op Sales<\/strong><\/p>\n<p>Single-family home sales declined to a seasonally adjusted annual rate of 4.57 million in June, down 4.8% from 4.80 million in May and down 12.8% from one year ago. The median existing single-family home price was $423,300 in June, up 13.3% from June 2021.<\/p>\n<p>Existing condominium and co-op sales were recorded at a seasonally adjusted annual rate of 550,000 units in June, down 9.8% from May and down 24.7% from one year ago. The median existing condo price was $354,900 in June, an annual increase of 11.5%.<\/p>\n<p>&#8220;Owning a home can create a path to financial freedom and lead to long-term wealth gains that families can pass on to future generations,&#8221; said NAR President Leslie Rouda Smith, a REALTOR® from Plano, Texas, and a broker associate at Dave Perry-Miller Real Estate in Dallas. &#8220;We will remain steadfast in our efforts to protect homeowner rights, and our members will continue to deliver valuable expertise to consumers throughout the home buying process.&#8221;<\/p>\n<p><strong>Regional Breakdown<\/strong><\/p>\n<p>At an annual rate of 670,000 in June, existing-home sales in the Northeast were unchanged from May and down 11.8% from June 2021. The median price in the Northeast was $453,300, a 10.1% jump from one year ago.<\/p>\n<p>Existing-home sales in the Midwest slid 1.6% from the previous month to an annual rate of 1,230,000 in June, retreating 9.6% from June 2021. The median price in the Midwest was $306,900, a 10.2% increase from one year before.<\/p>\n<p>Existing-home sales in the South slipped 6.2% in June to an annual rate of 2,260,000, down 14.1% from the previous year. The median price in the South was $374,900, a 16.8% bounce from one year ago. For the tenth consecutive month, the South recorded the highest pace of price appreciation in comparison to the other three regions.<\/p>\n<p>Existing-home sales in the West decreased 11.1% compared to the month before to an annual rate of 960,000 in June, down 21.3% from this time last year. The median price in the West was $624,000, an increase of 9.6% from June 2021.<\/p>\n<p>The National Association of REALTORS® is America&#8217;s largest trade association, representing more than 1.5 million members involved in all aspects of the residential and commercial real estate industries.<\/p>\n<p># # #<\/p>\n<p>For local information, please contact the local association of REALTORS® for data from local multiple listing services (MLS). Local MLS data is the most accurate source of sales and price information in specific areas, although there may be differences in reporting methodology.<\/p>\n<p>NOTE: NAR&#8217;s Pending Home Sales Index for June is scheduled for release on July 27, and Existing-Home Sales for July will be released on August 18. Release times are 10 a.m. Eastern.<\/p>\n<p>Information about NAR is available at <a href=\"https:\/\/www.nar.realtor\/\">nar.realtor<\/a>. This and other news releases are posted in the newsroom at <a href=\"https:\/\/www.nar.realtor\/newsroom\">nar.realtor\/newsroom<\/a>. Statistical data in this release, as well as other tables and surveys, are posted in the &#8220;Research and Statistics&#8221; tab.<\/p>\n<p>Existing-home sales, which include single-family, townhomes, condominiums and co-ops, are based on transaction closings from Multiple Listing Services. Changes in sales trends outside of MLSs are not captured in the monthly series. NAR benchmarks home sales periodically using other sources to assess overall home sales trends, including sales not reported by MLSs.<\/p>\n<p>Existing-home sales, based on closings, differ from the U.S. Census Bureau&#8217;s series on new single-family home sales, which are based on contracts or the acceptance of a deposit. Because of these differences, it is not uncommon for each series to move in different directions in the same month. In addition, existing-home sales, which account for more than 90% of total home sales, are based on a much larger data sample – about 40% of multiple listing service data each month – and typically are not subject to large prior-month revisions.<\/p>\n<p>The annual rate for a particular month represents what the total number of actual sales for a year would be if the relative pace for that month were maintained for 12 consecutive months. Seasonally adjusted annual rates are used in reporting monthly data to factor out seasonal variations in resale activity. For example, home sales volume is normally higher in the summer than in the winter, primarily because of differences in the weather and family buying patterns. However, seasonal factors cannot compensate for abnormal weather patterns.<\/p>\n<p>Single-family data collection began monthly in 1968, while condo data collection began quarterly in 1981; the series were combined in 1999 when monthly collection of condo data began. Prior to this period, single-family homes accounted for more than nine out of 10 purchases. Historic comparisons for total home sales prior to 1999 are based on monthly single-family sales, combined with the corresponding quarterly sales rate for condos.<\/p>\n<p>Total inventory and month&#8217;s supply data are available back through 1999, while single-family inventory and month&#8217;s supply are available back to 1982 (prior to 1999, single-family sales accounted for more than 90% of transactions and condos were measured only on a quarterly basis).<\/p>\n<p>The median price is where half sold for more and half sold for less; medians are more typical of market conditions than average prices, which are skewed higher by a relatively small share of upper-end transactions. The only valid comparisons for median prices are with the same period a year earlier due to seasonality in buying patterns. Month-to-month comparisons do not compensate for seasonal changes, especially for the timing of family buying patterns. Changes in the composition of sales can distort median price data. Year-ago median and mean prices sometimes are revised in an automated process if additional data is received.<\/p>\n<p>The national median condo\/co-op price often is higher than the median single-family home price because condos are concentrated in higher-cost housing markets. However, in a given area, single-family homes typically sell for more than condos as seen in NAR&#8217;s quarterly metro area price reports.<\/p>\n<p>Survey results represent owner-occupants and differ from separately reported monthly findings from NAR&#8217;s <a href=\"https:\/\/www.nar.realtor\/research-and-statistics\/research-reports\/realtors-confidence-index\">Realtors® Confidence Index<\/a>, which include all types of buyers. The annual study only represents primary residence purchases, and does not include investor and vacation home buyers. Results include both new and existing homes.<\/p>\n<p>[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text] Key Highlights Existing-home sales declined for the fifth straight month to a seasonally adjusted annual rate of 5.12 million. Sales were down 5.4% from May and 14.2% from one year ago. The median existing-home sales price climbed 13.4% from one year ago to $416,000, a new record high. The inventory of unsold existing homes rose to 1.26 million by the end of June, &#8230;<\/p>\n","protected":false},"author":2,"featured_media":31241,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[166],"tags":[],"class_list":["post-31243","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-properties"],"_links":{"self":[{"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/posts\/31243","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/comments?post=31243"}],"version-history":[{"count":0,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/posts\/31243\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/media\/31241"}],"wp:attachment":[{"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/media?parent=31243"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/categories?post=31243"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/tags?post=31243"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}