{"id":5471,"date":"2023-02-14T04:08:55","date_gmt":"2023-02-14T04:08:55","guid":{"rendered":"https:\/\/sharifrealty.com\/?p=5471"},"modified":"2023-02-14T04:08:55","modified_gmt":"2023-02-14T04:08:55","slug":"florida-realtors-work-to-defeat-rent-control","status":"publish","type":"post","link":"https:\/\/sharifrealty.com\/florida-realtors-work-to-defeat-rent-control\/","title":{"rendered":"Florida REALTORS Work to Defeat Rent Control"},"content":{"rendered":"<p>[vc_row][vc_column][vc_column_text]Unable to wait for a legal ruling to keep an unconstitutional rent control measure off the ballot in Orange County, Florida REALTORS<sup>®<\/sup> launched a major campaign to discourage voters from accepting the measure.  The effort targeted the county’s renters and homeowners, saturating the respective voting pools with reasons not to adopt rent control, and demonstrated to the rest of the state that the REALTORS<sup>®<\/sup> are prepared to fight the issue statewide.<\/p>\n<p>A longtime champion of affordable and workforce housing, Florida REALTORS<sup>®<\/sup> knows that the root problem of the growing housing gap is a matter of inventory, and that rent control is not the solution.  So, last year, when Orange County passed a rent control ordinance – against the counsel of a consultant it had hired to study the legality of such a move – Florida REALTORS<sup>®<\/sup> and the Florida Apartment Association sued to keep the measure off the November ballot.  With the legal outcome uncertain as the election approached, it became imperative to discourage Orange County voters from embracing rent control.   An <a href=\"https:\/\/realtorparty.realtor\/campaign-services\/issues-mobilization\" data-di-id=\"di-id-23aefd80-1bd1e46e\">Issues Mobilization Grant<\/a> from the REALTOR<sup>®<\/sup> Party helped Florida REALTORS<sup>®<\/sup> to mount a persuasive campaign.<\/p>\n<p>As Genessa Casanova, Florida REALTORS<sup>®<\/sup>’ Senior Political Director, explains, the REALTORS<sup>®<\/sup> filed an appeal when a local judge allowed the ballot measure to move forward, despite the fact that the County had failed to meet the requirement for rent control to be permitted under Florida’s narrowly defined statutory exception: an existing housing emergency constituting a serious menace to the general public.  Meanwhile, nearly $40M that Orange County had received in federal rent assistance funds during the pandemic remained unspent.  “While we were pursuing our legal channels to keep the rent control measures off the ballot, those ballots went to print,” she says.  “We contacted the REALTOR<sup>®<\/sup> Party for help with a campaign to educate Orange County voters about the harmful economic effects of the proposed measures, whatever the outcome of our efforts in the courts.”  The expansive Issues Mobilization campaign employed a strategically bifurcated plan, with separate messages targeting renters and homeowners with television ads, direct mail, online advertising, and phone calls.<\/p>\n<p>Shortly before election day, Florida’s Fifth District Court of Appeal reversed the lower court’s decision – a great victory for the REALTORS<sup>®<\/sup> and for private property rights in Orange County, says Casanova.  There wasn’t time to re-print the ballots, and as the judge decided against posting signs announcing the update at polling stations, the REALTORS<sup>®<\/sup> pulled the direct phone calls and expensive television ads, but continued the rest of the campaign.  “We knew there would be a perception issue,” she explains, adding that while the vote was allowed, the decision was not certified, at the REALTORS<sup>®<\/sup>’ request.<\/p>\n<p>J.P. Fraites, a lobbyist with Florida REALTORS<sup>®<\/sup>, points out that the campaign made it clear to jurisdictions across the state that the REALTORS<sup>®<\/sup> and their allies were more than ready to fight the cause.  “In choosing to disregard the findings of their consultant’s study, the County Commission showed us how determined they were to establish rent control in their area..  Having to mount an Issues Mobilization campaign to speak directly to Orange County voters gave us a double advantage:  it elevated their understanding of the issue and set a high-profile example for the rest of the state, which we knew would be watching closely.  Instead of fighting individual battles in Florida’s 67 counties, we were able to get out in front of the issue and hopefully fight this battle only once.  This really was a huge victory, and the outcome has already influenced how other areas of the state are dealing with the prospect of rent control.” Casanova agrees:  “We’re always going to be engaged in protecting private property rights, state-wide.  This win gives us the momentum to work with state leaders to solve the root problems of inadequate housing once and for all.”<\/p>\n<p>In fact, the Florida REALTORS® public policy team used their efforts in Orange County to work with lawmakers to strengthen statewide measures against rent control. Those efforts paid off in the form of <a href=\"https:\/\/flsenate.gov\/Session\/Bill\/2023\/102\" data-di-id=\"di-id-44c4174b-d0aaffe5\">Senate Bill 102<\/a>, a comprehensive affordable housing bill that includes a rent control preemption to the state. If passed during Florida’s 2023 legislative session, the bill would prevent local governments from enacting rent control laws.<\/p>\n<p>For other REALTOR<sup>®<\/sup> organizations facing legislative challenges, she adds, “Our biggest takeaway is the importance of engaging early and taking the steps to use the resources and services that the REALTOR<sup>®<\/sup> Party provides.  Be pro-active, not reactive!”<\/p>\n<p>To learn more about how Florida REALTORS<sup>®<\/sup> are working to defend against rent control measures in Orange County and across the state, contact <a href=\"mailto:publicpolicy@floridarealtors.org\" data-di-id=\"di-id-90ee9c3-5996f80e\">publicpolicy@floridarealtors.org<\/a>.[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_column_text]Unable to wait for a legal ruling to keep an unconstitutional rent control measure off the ballot in Orange County, Florida REALTORS® launched a major campaign to discourage voters from accepting the measure.  The effort targeted the county’s renters and homeowners, saturating the respective voting pools with reasons not to adopt rent control, and demonstrated to the rest of the state that the REALTORS® are prepared &#8230;<\/p>\n","protected":false},"author":2,"featured_media":5474,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-5471","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog"],"_links":{"self":[{"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/posts\/5471","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/comments?post=5471"}],"version-history":[{"count":0,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/posts\/5471\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/media\/5474"}],"wp:attachment":[{"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/media?parent=5471"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/categories?post=5471"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sharifrealty.com\/wp-json\/wp\/v2\/tags?post=5471"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}